Repository: alexunique0519/Website_Localizaiton_example
Catalog: OEC06/App_GlobalResources/YYTranslations.*.resx
Languages: fr, zh

source: About
fr: À Propos
zh: 关于

# address
source: Street Address
fr: Adresse De Rue
zh: 地址

# backToList
source: return to List
fr: Retour à la liste
zh: 回到列表

source: Cell Phone
fr: Téléphone cellulaire
zh: 移动电话

# cellPhoneDigits
source: cell phone must have 10 digits (including area code)
fr: téléphone cellulaire doit avoir 10 chiffres (y compris le code régional)
zh: 移动电话号码必须为10位（包含区域号码）

source: Contact
zh: 联系方式

source: County
fr: Comté
zh: 县

source: Create
fr: Créer
zh: 创建

source: Create New Farm
fr: Créer une nouvelle ferme
zh: 创建新农场记录

# dataJoinedMustBeGiven
source: Date Joined must be given if Last Contact Date is given
fr: Inscrit doit être donnée si Dernière Contact Date est donné
zh: 如果最后填写最后联系日期，那么必须提供加入日期

source: Date Joined
fr: Date d'inscription
zh: 加入时间

source: Delete
fr: effacer
zh: 删除

# deleteException
source: Exception on delete:
fr: Exception lors de l'effacement:
zh: 数据删除异常:

source: Details
fr: détails
zh: 详情

source: Direction
zh: 方向

source: Edit
fr: éditer
zh: 编辑

source: Farm
fr: Ferme
zh: 农场

# FarmCannotBeContactedBeforeJoin
source: Farm cannot be contacted about plots before they have joined the program
fr: Ferme ne peut être contacté à propos de parcelles avant d'avoir rejoint le programme
zh: 农场在加入项目之前不能被联系

source: Farm ID
fr: Numéro de Ferme
zh: 农场编号

source: Farm Listing
fr: Annonce Ferme
zh: 农场列表

source: Farms
fr: Fermes
zh: 农场

# FieldMustBeDate
source: field '{0}' must be a date
fr: champ '{0}' doit être une date
zh: 此项 '{0}' 必须为有效日期

# FieldMustBeNumeric
source: field '{0}' must be a number
fr: champ '{0}' doit être un nombre
zh: 此项 '{0}' 必须为数字

source: Home
fr: Domicile
zh: 主页

source: Home Phone
fr: Téléphone Fixe
zh: 固定电话

# homePhoneDigits
source: home phone must have 10 digits (including area code)
fr: téléphone à la maison doit avoir 10 chiffres (y compris le code régional)
zh: 固定电话号码必须为10位（包含区域号码）

# insertException
source: Exception on insert:
fr: Exception à l'insertion:
zh: 插入数据异常：

source: Last Contact Date
fr: Dernière Contact Date
zh: 上次联系时间

# name
source: Farm Name
fr: Nom De Ferme
zh: 农场名称

# oneTownOrCountyShouldBeProvided
source: at least one of town or county must be provided
fr: au moins un de la ville ou du comté doivent être fournis
zh: 城镇或县的名称至少需要提供一个

source: Postal Code
fr: Code Postal
zh: 邮编

# postalCodeReg
source: '{0}' should match canadian postal Code pattern (eg. N2C 2H7)
fr: '{0}' doit correspondre modèle canadien de la poste (par ex. N2C 2H7)
zh: '{0}' 应符合加拿大邮编格式（如: N2C 2H7）

# provinceCode
source: Province
zh: 省

# provinceCodeLength
source: the length of province code can only be 2
fr: la longueur du code de la province ne peut être 2
zh: 省简称长度为2

# provinceCodeLetter
source: the province code can only be letters
fr: le code de province ne peut être des lettres
zh: 省简称只能由字母组成

# provinceCodeReg
source: '{0}' should match canadian province code pattern (eg. ON)
fr: '{0}' doit correspondre canadien motif de code de province (ex. ON)
zh: '{0}'应符合加拿大省编号格式（如: ON）

# provinceNotOnFile
source: province code '{0}' is not on file
fr: code de province '{0}' ne est pas dans le dossier
zh: 省缩写 '{0}' 不在数据库中

# recordDeletedForX
source: the farm '{0}' has been deleted successfully
fr: la ferme '{0}' a été supprimé avec succès
zh: 农场记录 '{0}' 被成功删除

# recordInsertedForX
source: one new record inserted for '{0}'
fr: une nouveau record inséré pour '{0}'
zh: 一条新纪录成功添加: '{0}'

# recordUpdatedForX
source: record uptated for '{0}'
fr: enregistrement mis à jour pour '{0}'
zh: 记录 '{0}' 更新成功

# Required
source: a non-blank '{0}' is required
fr: un non-blanc '{0}' est nécessaire
zh: '{0}' 不能为空

source: Select Language
fr: Choisir la Langue
zh: 选择语言

source: Town
fr: Ville
zh: 城镇

# updateException
source: Exception on update:
fr: Exception sur mise à jour:
zh: 数据更新异常：

# XDateCannotBeInFuture
source: '{0}' cannot be in the future
fr: '{0}' ne peut pas être dans l'avenir
zh: ‘{0}’ 不能为将来时间
